# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
# #################################################################################

#метод з консультації
st = 'as 23 fdfdg544 34'
print(', '.join(''.join(ch if ch.isdigit() else ' ' for ch in st).split()))

#пояснення коду і методів з консультації
# ch if ch.isdigit() else ' ':
# Це генератор виразів, який проходить по кожному символу рядка st. Якщо символ є цифрою (ch.isdigit()
# повертає True), він залишається без змін. Якщо ж символ не є цифрою, замість нього вставляється пробіл ' '.
#
# ''.join(...):
# Цей метод об'єднує всі символи, які були отримані на попередньому етапі, в один рядок. '
# 'Отже, всі цифри залишаються на своїх місцях, а всі інші символи замінюються пробілами.)
#
# Наприклад, для рядка 'as 23 fdfdg544 34' результат цього кроку буде таким: ' 23 544 34'.
#
# .split():
# Метод split() розбиває рядок на список підрядків, використовуючи пробіл як роздільник.
# Пробіли між цифрами будуть видалені, і ми отримаємо список рядків, кожен з яких містить тільки цифри.
#
# Наприклад, результатом буде список ['23', '544', '34'].
#
# ', '.join(...):
# Метод join об'єднує елементи списку в один рядок, розділяючи їх комами з пробілами. Наприклад, список ['23', '544', '34(']'
# ' перетворюється на рядок ')23, 544, 34'.

# мій метод:
# nums = ''
# i = 0
# while i < len(st):
#     if st[i].isdigit():
#         nums += st[i]
#     else:
#         if nums:
#             print(nums, end=', ')
#             nums = ''
#     i += 1
# if nums:
#     print(nums)