# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
# #################################################################################

st = 'as 23 fdfdg544 34'
nums = ''
i = 0

while i < len(st):
    if st[i].isdigit():
        nums += st[i]
    else:
        if nums:
            print(nums, end=', ')
            nums = ''
    i += 1
if nums:
    print(nums)